### Data Cleaning

In [57]:
import pandas as pd
import numpy
import sklearn
titanic = pd.read_csv("../datasets/Titanic Dataset.csv")

the_titanic = pd.read_csv("../datasets/The Titanic dataset.csv")
# the_titanic = pd.read_csv("../datasets/The Titanic dataset.csv", header=1)


the_titanic.head(10)

SyntaxError: invalid syntax (1804389547.py, line 4)

In [163]:
the_titanic.columns = the_titanic.iloc[0]
the_titanic_df= the_titanic[1:].reset_index(drop=True)
the_titanic_df

,sn,pclass,survived,NaN,gender,age,family,fare,embarked,date
0,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
1,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
2,2,3,0,Master. Eugene Joseph,male,?,2,20.25,S,02-Jan-90
3,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,NaN,2,**,S,03-Jan-90
4,4,3,1,"Abbott, Mr. Rossmore Edward",female,35,2,20.25,S,04-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1296,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24,0,13,S,19-Jul-93
1297,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1298,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1299,1299,3,0,"Zakarian, Mr. Ortin",male,27,0,7.225,C,22-Jul-93
1300,1300,3,0,"Zimmerman, Mr. Leo",male,29,0,7.875,S,23-Jul-93

In [164]:
the_titanic_df.rename(columns={the_titanic.columns[3]: 'name'}, inplace=True)
# the_titanic['date'] = pd.to_datetime(the_titanic['date'])
the_titanic_df.drop_duplicates(inplace=True)
the_titanic_df

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
0,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
2,2,3,0,Master. Eugene Joseph,male,?,2,20.25,S,02-Jan-90
3,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,NaN,2,**,S,03-Jan-90
4,4,3,1,"Abbott, Mr. Rossmore Edward",female,35,2,20.25,S,04-Jan-90
5,5,3,1,"Abelseth, Miss. Karen Marie",female,16,0,7.65,S,05-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1296,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24,0,13,S,19-Jul-93
1297,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1298,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1299,1299,3,0,"Zakarian, Mr. Ortin",male,27,0,7.225,C,22-Jul-93
1300,1300,3,0,"Zimmerman, Mr. Leo",male,29,0,7.875,S,23-Jul-93

In [165]:
the_titanic_df[['sn', 'pclass', 'survived', 'age', 'family', 'fare']].describe()
the_titanic_df.describe()

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
count,1300,1300,1300,1300,1299,1043,1298,1298,1295,1300
unique,1300,3,2,1297,2,97,9,282,3,1300
top,1,3,0,"Abbott, Mr. Rossmore Edward",male,24,0,13,S,01-Jan-90
freq,1,699,800,2,834,47,780,59,905,1

In [166]:
non_numeric_values = pd.to_numeric(the_titanic_df['age'], errors='coerce')
the_titanic_df['age'] = non_numeric_values

mean_age = int(the_titanic_df['age'].mean())
the_titanic_df['age'] = the_titanic_df['age'].fillna(mean_age)
the_titanic_df

,sn,pclass,survived,name,gender,age,family,fare,embarked,date
0,1,3,0,Mr. Anthony,male,42.0,0,7.55,NaN,01-Jan-90
2,2,3,0,Master. Eugene Joseph,male,29.0,2,20.25,S,02-Jan-90
3,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,29.0,2,**,S,03-Jan-90
4,4,3,1,"Abbott, Mr. Rossmore Edward",female,35.0,2,20.25,S,04-Jan-90
5,5,3,1,"Abelseth, Miss. Karen Marie",female,16.0,0,7.65,S,05-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1296,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,0,13,S,19-Jul-93
1297,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1298,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1299,1299,3,0,"Zakarian, Mr. Ortin",male,27.0,0,7.225,C,22-Jul-93
1300,1300,3,0,"Zimmerman, Mr. Leo",male,29.0,0,7.875,S,23-Jul-93

In [167]:
df = the_titanic_df.drop_duplicates('name')

In [ ]:
non_numeric_values_fare = pd.to_numeric(the_titanic_df['fare'], errors='coerce')
the_titanic_df['fare'] = non_numeric_values_fare
mean_fare = int(the_titanic_df['fare'].mean())

the_titanic_df['fare'] = the_titanic_df['fare'].fillna(mean_fare)
the_titanic_df['gender'] = the_titanic_df['gender'].fillna("male")

mode_embark = the_titanic_df['embarked'].mode()
the_titanic_df['embarked'] = the_titanic_df['embarked'].fillna(mode_embark)
the_titanic_df



non_numeric_values_fam = pd.to_numeric(the_titanic_df['family'], errors='coerce')
the_titanic_df['family'] = non_numeric_values_fam
mode_family = the_titanic_df['family'].mode()
the_titanic_df['family'] = the_titanic_df['family'].fillna(mode_family)

C:\Users\kojos\AppData\Local\Temp\ipykernel_15180\4009268908.py:16: FutureWarning: Calling int on a single element Series is deprecated and will raise a TypeError in the future. Use int(ser.iloc[0]) instead
  mode_family = int(the_titanic_df['family'].mode())

In [169]:
the_titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1300 entries, 0 to 1300
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sn        1300 non-null   object
 1   pclass    1300 non-null   object
 2   survived  1300 non-null   object
 3   name      1300 non-null   object
 4   gender    1300 non-null   object
 5   age       1300 non-null   float64
 6   family    1300 non-null   float64
 7   fare      1300 non-null   float64
 8   embarked  1296 non-null   object
 9   date      1300 non-null   object
dtypes: float64(3), object(7)
memory usage: 111.7+ KB

In [170]:
the_titanic_df['embarked'].value_counts(dropna=False)

embarked
S      906
C      267
Q      123
NaN      4
Name: count, dtype: int64